Revit 2026 API
ViewPositionFailures Properties
The BuiltInFailures.ViewPositionFailures type exposes the following members.
Properties
Name | Description
CantMoveViewport |  Can't move Viewport when its placement is controlled by the assigned View Position.
CropRequiredAlignment |  Can't move Viewport when its placement is controlled by the assigned View Position.
ViewAnchorDoesNotSupportView |  The View Anchor ""%1!s!"" is not supported by view ""%2!s!"".
Top
See Also
Reference
BuiltInFailures.ViewPositionFailures Class
Autodesk.Revit.DB Namespace